In [192]:
import pandas as pd
import numpy as np
import datetime

Primero leemos los dataset por separado. Luego pasamos a dividir el problema en 5 partes: La primera y segunda será sobre la demanda donde se estudiará el consumo total del pais por horas y luego por dias, la tercera y cuarta lo mismo pero con los datos de produccion y la quitan será buscar relacion entre la demanda y la produccion incluyendo eventos que afecten a estos datos

In [193]:
datosDemandaBruto = pd.read_csv("Demand13.csv")
datosProduccionBruto = pd.read_csv("Supply13.csv")

In [194]:
print(datosDemandaBruto)
datosDemandaBruto.head()

       Hours  Baghdad  Nynwa  Kirkuk  Slah El-Din  Anbar  Dyala  Babil  Kerb.  \
0          1     3294   1243     757          488    471    598    525    514
1          2     2973   1151     753          477    436    570    500    469
2          3     2758   1105     727          471    419    604    478    430
3          4     2703   1220     717          470    463    564    497    465
4          5     2954   1358     751          519    515    626    553    517
...      ...      ...    ...     ...          ...    ...    ...    ...    ...
26347     20     4894   1906    1206         1008    912   1112   1112    914
26348     21     4550   1798    1158          928    862   1047   1027    869
26349     22     4326   1683    1091          868    818   1001    972    807
26350     23     4090   1567     988          819    782    935    892    780
26351     24     3954   1465     942          780    750    879    838    728

       Najaf  Dywan.  Wasit  Muthnna  Thi-Qar  Mesan  Basrah
0        474     307    404      208      573    369    1254
1        437     284    374      193      536    342    1100
2        420     273    359      185      519    328    1056
3        451     301    397      204      522    363    1100
4        502     335    442      228      574    404    1298
...      ...     ...    ...      ...      ...    ...     ...
26347    885     683    885      390     1092    701    2025
26348    811     634    831      353      985    640    1883
26349    751     603    767      327      914    586    1809
26350    702     564    737      314      842    533    1675
26351    656     541    719      301      799    495    1494

[26352 rows x 16 columns]

,Hours,Baghdad,Nynwa,Kirkuk,Slah El-Din,Anbar,Dyala,Babil,Kerb.,Najaf,Dywan.,Wasit,Muthnna,Thi-Qar,Mesan,Basrah
0,1,3294,1243,757,488,471,598,525,514,474,307,404,208,573,369,1254
1,2,2973,1151,753,477,436,570,500,469,437,284,374,193,536,342,1100
2,3,2758,1105,727,471,419,604,478,430,420,273,359,185,519,328,1056
3,4,2703,1220,717,470,463,564,497,465,451,301,397,204,522,363,1100
4,5,2954,1358,751,519,515,626,553,517,502,335,442,228,574,404,1298

In [195]:
print(datosProduccionBruto)
datosProduccionBruto.head()

       Hours  Bagh.  Nynwa  Kirkuk  Slah El-Din  Anbar  Dyala  Babil  Kerb.  \
0          1   3294    740     668          488    394    598    525    514
1          2   2973    751     753          477    387    570    500    469
2          3   2758    760     727          471    374    604    478    430
3          4   2703    759     717          470    365    546    490    433
4          5   2794    727     751          470    374    578    539    472
...      ...    ...    ...     ...          ...    ...    ...    ...    ...
26347     20   3364    765     762          418    421    587    648    608
26348     21   3437    748     751          412    418    617    678    638
26349     22   3368    761     751          420    411    603    719    689
26350     23   3373    801     782          424    406    614    663    681
26351     24   3169    853     759          422    404    604    568    593

       Najaf  Dywan.  Wasit  Muthnna  Thi-Qar  Mesan  Basrah
0        474     246    397      185      573    294    1104
1        437     223    362      177      536    269    1030
2        420     210    347      169      519    229     956
3        420     202    350      172      522    232     953
4        449     246    389      191      574    275    1003
...      ...     ...    ...      ...      ...    ...     ...
26347    581     470    661      327      866    585    1691
26348    605     489    612      302      825    527    1580
26349    631     453    565      277      766    456    1450
26350    620     387    496      250      690    327    1288
26351    569     317    433      222      610    297    1180

[26352 rows x 16 columns]

,Hours,Bagh.,Nynwa,Kirkuk,Slah El-Din,Anbar,Dyala,Babil,Kerb.,Najaf,Dywan.,Wasit,Muthnna,Thi-Qar,Mesan,Basrah
0,1,3294,740,668,488,394,598,525,514,474,246,397,185,573,294,1104
1,2,2973,751,753,477,387,570,500,469,437,223,362,177,536,269,1030
2,3,2758,760,727,471,374,604,478,430,420,210,347,169,519,229,956
3,4,2703,759,717,470,365,546,490,433,420,202,350,172,522,232,953
4,5,2794,727,751,470,374,578,539,472,449,246,389,191,574,275,1003

Para el total de horas sumaremos el valor de todas las columna, ya que cada columna representa el valor de cada provincia, creando una nueva columna con esto mismo. PODEMOS CREAR OTRO DATASET O DEJARLO AQUI Y VER QUE PROVINCIA ES LA QUE MAS AFECTA A ESTOS DATOS.

In [196]:
datosDemandaTotalHoras = pd.DataFrame()
datosProduccionTotalHoras = pd.DataFrame()

In [197]:
datosDemandaTotalHoras["total"] = datosDemandaBruto.iloc[:, 1:].sum(axis=1)
datosProduccionTotalHoras["total"] = datosProduccionBruto.iloc[:, 1:].sum(axis=1)

In [198]:
datosDemandaTotalHoras["Hours"] = datosDemandaBruto["Hours"]
datosProduccionTotalHoras["Hours"] = datosProduccion["Hours"]

In [199]:
datosDemandaTotalSinHoras = pd.DataFrame()
datosProduccionTotalSinHoras = pd.DataFrame()

In [200]:
datosDemandaTotalSinHoras["total"] = datosDemandaBruto.iloc[:, 1:].sum(axis=1)
datosProduccionTotalSinHoras["total"] = datosProduccionBruto.iloc[:, 1:].sum(axis=1)

In [201]:
datosDemandaTotalHoras.head()

   total  Hours
0  11479      1
1  10595      2
2  10132      3
3  10437      4
4  11576      5

In [202]:
datosDemandaTotalSinHoras.head()

   total
0  11479
1  10595
2  10132
3  10437
4  11576

Ahora partimos de un nuevo dataset el cual tiene una columna con las demanda/produccion por horas, es decir cada fila es una hora y cada 24 filas es un día. Una vez tenemos estos dos dataset, vamos a pasar estas horas a dias para tener los otros dos dataset faltantes.

In [203]:
suma_24_demanda = []
suma_24_produccion = []

In [204]:
for i in range(0, len(datosDemandaTotalSinHoras), 24):
    end = i + 24
    if end > len(datosDemandaTotalSinHoras):
        end = len(datosDemandaTotalSinHoras)
    suma_24_demanda.append(datosDemandaTotalSinHoras[i:end].sum(axis=0).sum())

In [205]:
for i in range(0, len(datosProduccionTotalSinHoras), 24):
    end = i + 24
    if end > len(datosProduccionTotalSinHoras):
        end = len(datosProduccionTotalSinHoras)
    suma_24_produccion.append(datosProduccionTotalSinHoras[i:end].sum(axis=0).sum())

In [206]:
datosDemandaTotalDias = pd.DataFrame({'Total': suma_24_demanda})
datosProduccionTotalDias = pd.DataFrame({'Total': suma_24_produccion})

In [207]:
diasDemanda = pd.date_range(start='2019-01-01', periods=len(suma_24_demanda), freq='D')
diasProduccion = pd.date_range(start='2019-01-01', periods=len(suma_24_produccion), freq='D')

In [208]:
datosDemandaTotalDias["fecha"] = diasDemanda
datosProduccionTotalDias["fecha"] = diasProduccion

Despues de hacer todas estas transformaciones ya tenemos los 4 dataset que queremos: datosDemandaTotalHoras/datosProduccionTotalHoras los cuales tiene la produccion total por ahora y datosDemandaTotalDias/datosProduccionTotalDias los cuales tienen la produccion por dias

In [209]:
datosDemandaTotalHoras.head()

   total  Hours
0  11479      1
1  10595      2
2  10132      3
3  10437      4
4  11576      5

In [210]:
datosProduccionTotalHoras.head()

   total  Hours
0  10494      1
1   9914      2
2   9452      3
3   9334      4
4   9832      5

In [211]:
datosDemandaTotalDias.head()

    Total      fecha
0  379726 2019-01-01
1  383590 2019-01-02
2  378901 2019-01-03
3  378180 2019-01-04
4  385805 2019-01-05

In [212]:
datosProduccionTotalDias.head()

    Total      fecha
0  289005 2019-01-01
1  288843 2019-01-02
2  283581 2019-01-03
3  285621 2019-01-04
4  283991 2019-01-05